update cmake files and fix some bugs
